xfire-spring/src/test/org/codehaus/xfire/spring/echoRequest.xml

<env:Envelope xmlns:env="http://schemas.xmlsoap.org/soap/envelope/">
 <env:Header/>
 <env:Body>
  <m:echo xmlns:m="http://spring.xfire.codehaus.org">
   <m:in0>Yo Yo</m:in0>
  </m:echo>
 </env:Body>
</env:Envelope>